{
  "_class_name": "LTX2TextConnectors",
  "_diffusers_version": "0.37.0.dev0",
  "audio_connector_attention_head_dim": 64,
  "audio_connector_num_attention_heads": 32,
  "audio_connector_num_layers": 8,
  "audio_connector_num_learnable_registers": 128,
  "audio_gated_attn": true,
  "audio_hidden_dim": 2048,
  "caption_channels": 3840,
  "causal_temporal_positioning": false,
  "connector_rope_base_seq_len": 4096,
  "per_modality_projections": true,
  "proj_bias": true,
  "rope_double_precision": true,
  "rope_theta": 10000.0,
  "rope_type": "split",
  "text_proj_in_factor": 49,
  "video_connector_attention_head_dim": 128,
  "video_connector_num_attention_heads": 32,
  "video_connector_num_layers": 8,
  "video_connector_num_learnable_registers": 128,
  "video_gated_attn": true,
  "video_hidden_dim": 4096
}
