{
  "_blocks_class_name": "HeliosPyramidDistilledAutoBlocks",
  "_class_name": "HeliosPyramidDistilledModularPipeline",
  "_diffusers_version": "0.38.0.dev0",
  "guider": [
    "diffusers",
    "ClassifierFreeGuidance"
  ],
  "scheduler": [
    "diffusers",
    "HeliosDMDScheduler",
    {
      "pretrained_model_name_or_path": "BestWishYsh/Helios-Distilled",
      "revision": null,
      "subfolder": "scheduler",
      "type_hint": [
        "diffusers",
        "HeliosDMDScheduler"
      ],
      "variant": null
    }
  ],
  "text_encoder": [
    "transformers",
    "UMT5EncoderModel",
    {
      "pretrained_model_name_or_path": "BestWishYsh/Helios-Distilled",
      "revision": null,
      "subfolder": "text_encoder",
      "type_hint": [
        "transformers",
        "UMT5EncoderModel"
      ],
      "variant": null
    }
  ],
  "tokenizer": [
    "transformers",
    "T5Tokenizer",
    {
      "pretrained_model_name_or_path": "BestWishYsh/Helios-Distilled",
      "revision": null,
      "subfolder": "tokenizer",
      "type_hint": [
        "transformers",
        "T5Tokenizer"
      ],
      "variant": null
    }
  ],
  "transformer": [
    "diffusers",
    "HeliosTransformer3DModel",
    {
      "pretrained_model_name_or_path": "BestWishYsh/Helios-Distilled",
      "revision": null,
      "subfolder": "transformer",
      "type_hint": [
        "diffusers",
        "HeliosTransformer3DModel"
      ],
      "variant": null
    }
  ],
  "vae": [
    "diffusers",
    "AutoencoderKLWan",
    {
      "pretrained_model_name_or_path": "BestWishYsh/Helios-Distilled",
      "revision": null,
      "subfolder": "vae",
      "type_hint": [
        "diffusers",
        "AutoencoderKLWan"
      ],
      "variant": null
    }
  ]
}
