{
  "_class_name": "UniPCMultistepScheduler",
  "_diffusers_version": "0.34.0.dev0",
  "disable_corrector": [],
  "dynamic_thresholding_ratio": 0.995,
  "final_sigmas_type": "zero",
  "lower_order_final": true,
  "num_train_timesteps": 1000,
  "predict_x0": true,
  "prediction_type": "flow_prediction",
  "sample_max_value": 1.0,
  "flow_shift": 1.0,
  "solver_order": 2,
  "solver_p": null,
  "solver_type": "bh2",
  "steps_offset": 0,
  "thresholding": false,
  "use_flow_sigmas": true,
  "timestep_spacing": "linspace"
}
