{
  "_class_name": "Kandinsky5Transformer3DModel",
  "_diffusers_version": "0.33.0.dev0",
  "in_visual_dim": 16,
  "out_visual_dim": 16,
  "time_dim": 512,
  "patch_size": [
    1, 
    2, 
    2
  ],
  "model_dim": 1792,
  "ff_dim": 7168,
  "num_text_blocks": 2,
  "num_visual_blocks": 32,
  "axes_dims": [
    16, 
    24, 
    24
  ],
  "visual_cond": true,
  "in_text_dim": 3584,
  "in_text_dim2": 768,
  "attention_type": "nabla",
  "attention_causal": false,
  "attention_local": false,
  "attention_glob": false,
  "attention_window": 3,
  "attention_P": 0.9,
  "attention_wT": 11,
  "attention_wW": 3,
  "attention_wH": 3,
  "attention_add_sta": true,
  "attention_method": "topcdf"
}


