{
  "_class_name": "HeliosPipeline",
  "_diffusers_version": "0.37.0.dev0",
  "scheduler": [
    "diffusers",
    "HeliosScheduler"
  ],
  "text_encoder": [
    "transformers",
    "UMT5EncoderModel"
  ],
  "tokenizer": [
    "transformers",
    "T5TokenizerFast"
  ],
  "transformer": [
    "diffusers",
    "HeliosTransformer3DModel"
  ],
  "vae": [
    "diffusers",
    "AutoencoderKLWan"
  ]
}
